{
    "projects" : [
        {
            "title": "Esports Gaming Website (ESGN)",
            "bodyText": "- Collaborated on a team of 5 to build a responsive multiplatform esports web-app.\n - Utilizes APIs to give real-time updates on games and headlines as well as live game footage.\n - Full-Stack web application will be hosted and deployed on AWS.",
            "tags" : [
                "AWS",
                "React",
                "Tailwind Css",
                "Express",
                "MongoDB",
                "Rest API"
            ]
        },
        {
            "title": "Real-time Water Sensor App (Hack West Texas Hackathon)",
            "bodyText": "- Developed a dynamic web application that leveraged AWS IoT to provide real-time water sensor data based on user-provided zip codes\n - Deployed the application using AWS Elastic Beanstalk, ensuring scalability and reliability",
            "tags" : [
                "AWS",
                "React",
                "Node",
                "Express",
                "MongoDB"
            ]
        },
        {
            "title": "Automatic Spending Spreadsheet Web App",
            "bodyText": "- Designed and implemented an innovative web application that streamlines expense tracking\n - Integrated SMS with Twilio and receipt image parsing to automatically populate item details and prices into a user’s personal spending spreadsheet",
            "tags" : [
                "Javascript",
                "Twilio",
                "WebScrapper",
                "Python"
            ]
        },
        {
            "title": "Local Movie Theater Web App",
            "bodyText": "- Created a feature-rich web application using Node.js, React, and MongoDB for a local movie theater platform\n - Enabled users to browse movies and theaters, create accounts, and purchase tickets seamlessly\n - Utilized full-stack development skills to deliver a user-friendly experience",
            "tags" : [
                "React",
                "Node.js",
                "MongoDB",
                "express",
                "Javascript"
            ]
        }
    ]
}